# Managing Time Series Data - Lab

## Introduction

In the previous lecture, you learned that time series data are everywhere and understanding time series data is an important skill for data scientists!

In this lab, you'll practice your previously learned techniques to import/load, clean and manipulate time series data.

The lab will cover how to perform time series analysis while working with large datasets. The dataset can be memory intensive so your computer will need at least 2GB of memory to perform some of the calculations.


## Objectives

You will be able to:

* Load time series data using Pandas and perform time series indexing
* Perform index based slicing to create subsets of a time series
* Change the granularity of a time series 
* Perform basic data cleaning operations on time series data

## Let's get started!

We will start the lab by loading the required libraries 

* `pandas` for data wrangling and manipulations  
* `matplotlib` for visualizing time series data 
* `statsmodels` primarily for bundled datasets

In [57]:
# Load required libraries
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import statsmodels.api as sm

## Loading time series data
The `StatsModels` library comes bundled with built-in datasets for experimentation and practice. A detailed description of these datasets can be found [here](http://www.statsmodels.org/dev/datasets/index.html). Using `StatsModels`, the time series datasets can be loaded straight into memory. 

In this lab, we'll use the **"Atmospheric CO2 from Continuous Air Samples at Mauna Loa Observatory, Hawaii, U.S.A."**, containing CO2 samples from March 1958 to December 2001. Further details on this dataset are available [here](http://www.statsmodels.org/dev/datasets/generated/co2.html).

We can bring in this data using the `load_pandas()`-method, which will allow us to read this data into a pandas dataframe by using `dataset.data`.

In [62]:
# Load the "co2" dataset from sm.datasets
df = pd.DataFrame.from_records(sm.datasets.co2.load().data)
df['date'] = df.date.apply(lambda x: x.decode('utf-8'))
df['date'] = pd.to_datetime(df.date, format='%Y%m%d', utc=True)
# df.set_index('date')
df.head()

                       date    co2
0 1958-03-29 00:00:00+00:00  316.1
1 1958-04-05 00:00:00+00:00  317.3
2 1958-04-12 00:00:00+00:00  317.6
3 1958-04-19 00:00:00+00:00  317.5
4 1958-04-26 00:00:00+00:00  316.4

Let's check the type of CO2 and also first 15 entries of CO2 dataframe as our first exploratory step.

In [63]:
# Print the datatype of CO2 and check first 15 values
# df.head(15)
# datatype of CO2 is <class 'pandas.core.frame.DataFrame'>

#               co2
# 1958-03-29  316.1
# 1958-04-05  317.3
# 1958-04-12  317.6
# 1958-04-19  317.5
# 1958-04-26  316.4
# 1958-05-03  316.9
# 1958-05-10    NaN
# 1958-05-17  317.5
# 1958-05-24  317.9
# 1958-05-31    NaN
# 1958-06-07    NaN
# 1958-06-14    NaN
# 1958-06-21    NaN
# 1958-06-28    NaN
# 1958-07-05  315.8

With all the required packages imported and the CO2 dataset as a Dataframe ready to go, we can move on to indexing our data.

## Data Indexing

You may have noticed that by default, the dates have been set as the index of our pandas DataFrame. While working with time series data in Python, it's important to always ensure that dates are used as index values and are set as a `timestamp` object. Timestamp is the pandas equivalent of python’s `Datetime` and is interchangeable with it in most cases. It's the type used for the entries that make up a `DatetimeIndex`, and other time series oriented data structures in pandas. Further details can be found [here](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Timestamp.html).

We can confirm these assumption in python by checking index values of a pandas dataframe with `DataFrame.index`.

In [64]:
# Confirm that date values are used for indexing purpose in the CO2 dataset 
df = df.set_index(df.date)
df = df.iloc[:, 1:]

# DatetimeIndex(['1958-03-29', '1958-04-05', '1958-04-12', '1958-04-19',
#                '1958-04-26', '1958-05-03', '1958-05-10', '1958-05-17',
#                '1958-05-24', '1958-05-31',
#                ...
#                '2001-10-27', '2001-11-03', '2001-11-10', '2001-11-17',
#                '2001-11-24', '2001-12-01', '2001-12-08', '2001-12-15',
#                '2001-12-22', '2001-12-29'],
#               dtype='datetime64[ns]', length=2284, freq='W-SAT')

The output above shows that our dataset clearly fulfills the indexing requirements. Look at the last line:


### **dtype='datetime64[ns]', length=2284, freq='W-SAT'**


* `dtype=datetime[ns]` field confirms that the index is made of timestamp objects.
* `length=2284` shows the total number of entries in our time series data.
* `freq='W-SAT'` tells us that we have 2,284 weekly (W) date stamps starting on Saturdays (SAT).

## Resampling

Remember that depending on the nature of analytical question, the resolution of timestamps can also be changed to other frequencies. For this data set we can resample to monthly CO2 consumption values. This can be obtained by using the `resample() function`. Let's

* Group the time-series into buckets representing 1 month using `resample()` function.
* Apply a `mean()`function on each group (i.e. get monthly average).
* Combine the result as one row per monthly group.

In [67]:
# Group the timeseries into monthly buckets
# Take the mean of each group 
# get the first 10 elements of resulting timeseries

monthly = df.resample('MS')
monthly = monthly.mean()
# 1958-03-01    316.100000
# 1958-04-01    317.200000
# 1958-05-01    317.433333
# 1958-06-01           NaN
# 1958-07-01    315.625000
# 1958-08-01    314.950000
# 1958-09-01    313.500000
# 1958-10-01           NaN
# 1958-11-01    313.425000
# 1958-12-01    314.700000
# Freq: MS, Name: co2, dtype: float64
monthly

                                  co2
date
1958-03-01 00:00:00+00:00  316.100000
1958-04-01 00:00:00+00:00  317.200000
1958-05-01 00:00:00+00:00  317.433333
1958-06-01 00:00:00+00:00         NaN
1958-07-01 00:00:00+00:00  315.625000
1958-08-01 00:00:00+00:00  314.950000
1958-09-01 00:00:00+00:00  313.500000
1958-10-01 00:00:00+00:00         NaN
1958-11-01 00:00:00+00:00  313.425000
1958-12-01 00:00:00+00:00  314.700000
1959-01-01 00:00:00+00:00  315.500000
1959-02-01 00:00:00+00:00  316.700000
1959-03-01 00:00:00+00:00  316.733333
1959-04-01 00:00:00+00:00  317.675000
1959-05-01 00:00:00+00:00  318.325000
1959-06-01 00:00:00+00:00  318.025000
1959-07-01 00:00:00+00:00  316.525000
1959-08-01 00:00:00+00:00  314.900000
1959-09-01 00:00:00+00:00  313.825000
1959-10-01 00:00:00+00:00  313.400000
1959-11-01 00:00:00+00:00  314.875000
1959-12-01 00:00:00+00:00  315.525000
1960-01-01 00:00:00+00:00  316.380000
1960-02-01 00:00:00+00:00  316.975000
1960-03-01 00:00:00+00:00  317.575000
1960-04-01 00:00:00+00:00  319.120000
1960-05-01 00:00:00+00:00  319.925000
1960-06-01 00:00:00+00:00  319.450000
1960-07-01 00:00:00+00:00  318.060000
1960-08-01 00:00:00+00:00  315.775000
...                               ...
1999-07-01 00:00:00+00:00  369.000000
1999-08-01 00:00:00+00:00  366.700000
1999-09-01 00:00:00+00:00  364.675000
1999-10-01 00:00:00+00:00  365.140000
1999-11-01 00:00:00+00:00  366.650000
1999-12-01 00:00:00+00:00  367.900000
2000-01-01 00:00:00+00:00  369.020000
2000-02-01 00:00:00+00:00  369.375000
2000-03-01 00:00:00+00:00  370.400000
2000-04-01 00:00:00+00:00  371.540000
2000-05-01 00:00:00+00:00  371.650000
2000-06-01 00:00:00+00:00  371.625000
2000-07-01 00:00:00+00:00  369.940000
2000-08-01 00:00:00+00:00  367.950000
2000-09-01 00:00:00+00:00  366.540000
2000-10-01 00:00:00+00:00  366.725000
2000-11-01 00:00:00+00:00  368.125000
2000-12-01 00:00:00+00:00  369.440000
2001-01-01 00:00:00+00:00  370.175000
2001-02-01 00:00:00+00:00  371.325000
2001-03-01 00:00:00+00:00  372.060000
2001-04-01 00:00:00+00:00  372.775000
2001-05-01 00:00:00+00:00  373.800000
2001-06-01 00:00:00+00:00  373.060000
2001-07-01 00:00:00+00:00  371.300000
2001-08-01 00:00:00+00:00  369.425000
2001-09-01 00:00:00+00:00  367.880000
2001-10-01 00:00:00+00:00  368.050000
2001-11-01 00:00:00+00:00  369.375000
2001-12-01 00:00:00+00:00  371.020000

[526 rows x 1 columns]

Looking at the index values, we can see that our time series now carries aggregated data on monthly terms, shown as `Freq: MS`. 

### Time-series Index Slicing for Data Selection

Slice our dataset to only retrieve data points that come after the year 1990.

In [72]:
# Slice the timeseries to contain data after year 1990. 

# 1990-01-01    353.650
# 1990-02-01    354.650
#                ...   
# 2001-11-01    369.375
# 2001-12-01    371.020
# Freq: MS, Name: co2, Length: 144, dtype: float64

slice = monthly.loc['1990-01':]

Slice the time series for a given time interval. Let's try to retrieve data starting from Jan 1990 to Jan 1991.

In [74]:
# Retrieve the data between 1st Jan 1990 to 1st Jan 1991
ninety = slice.loc['1990-01':'1991-01']
# 1990-01-01    353.650
# 1990-02-01    354.650
# 1990-03-01    355.480
# 1990-04-01    356.175
# 1990-05-01    357.075
# 1990-06-01    356.080
# 1990-07-01    354.675
# 1990-08-01    352.900
# 1990-09-01    350.940
# 1990-10-01    351.225
# 1990-11-01    352.700
# 1990-12-01    354.140
# 1991-01-01    354.675
# Freq: MS, Name: co2, dtype: float64
ninety

                               co2
date
1990-01-01 00:00:00+00:00  353.650
1990-02-01 00:00:00+00:00  354.650
1990-03-01 00:00:00+00:00  355.480
1990-04-01 00:00:00+00:00  356.175
1990-05-01 00:00:00+00:00  357.075
1990-06-01 00:00:00+00:00  356.080
1990-07-01 00:00:00+00:00  354.675
1990-08-01 00:00:00+00:00  352.900
1990-09-01 00:00:00+00:00  350.940
1990-10-01 00:00:00+00:00  351.225
1990-11-01 00:00:00+00:00  352.700
1990-12-01 00:00:00+00:00  354.140
1991-01-01 00:00:00+00:00  354.675

## Missing Values

Check if there are missing values in the data set.

In [80]:
# Get the total number of missing values in the time series
monthly.isna().sum()
# 5

co2    5
dtype: int64

Remember that missing values can be filled in a multitude of ways. Look for the next valid entry in the time series and fills the gaps with this value. Next, check if your attempt was successful by checking for missing values again.

In [85]:
# perform backward filling of missing values
# check again for missing values
monthly.fillna(method='backfill', inplace=True)
# 0
monthly.isna().sum()

co2    0
dtype: int64

Great! Now your time series are ready for visualization and further analysis.

## Summary

In this introductory lab, you learned how to create a time series object in Python using Pandas. You learned how to check timestamp values as the data index and you learned about basic data handling techniques for getting time-series data ready for further analysis.